# coding: utf-8

print("hello world")

print(100+200)

print('100+200 =', 100+200)
#  逗号会输出成空格

# *******************************************************************************
# 输入/输出
# name = input()  # 和scanf类似
# print(name)

# name = input('please enter name:')
# print('hello',name)

# ********************************************************************************

# python对于大小写敏感

a = 100
if a > 100:         # 注意冒号 缩进
    print(a)
else:
    print(-a)

# ********************************************************************************

# 转义字符 \n表示换行，\t表示制表符，字符\本身也要转义，所以\\表示的字符就是\
print("I'm OK")
print("I'm \"OK\"")     # 转义字符 \    \"  \'

print('\\\t\\')
print(r'\\\t\\')    # r'' 表示不转义

# ********************************************************************************

# 字符串内部有很多换行，用\n写在一行里不好阅读，为了简化，Python允许用'''...'''的格式表示多行内容
print(r'''line1    
line2
line3''')

# ********************************************************************************

# 布尔值 True False   and 与 or 或 not 非
# None 空值  并不能理解为0

# ********************************************************************************

# = 赋值符号
a = 100
print(a)
a = 'be'   # 这种变量本身类型不固定的语言称之为动态语言
print(a)

# 赋值符号先计算右侧的值
x = 10
x = x + 10
print(x)

# 用全部大写的变量名表示常量

# ********************************************************************************

# 除法
print(10/3) # 3.3333333333333335
print(9/3)  # 3.0

print(10//3) # 3   //地板除  只保留整数

print(10%3)  # 1   //取余

# ********************************************************************************

# 字符串 编码

# 如果统一成Unicode编码，乱码问题从此消失了。
# 但是，如果你写的文本基本上全部是英文的话，
# 用Unicode编码比ASCII编码需要多一倍的存储空间，
# 在存储和传输上就十分不划算。

# 所以，本着节约的精神，又出现了把Unicode编码转化为“可变长编码”的UTF-8编码。
# UTF-8编码把一个Unicode字符根据不同的数字大小编码成1-6个字节，
# 常用的英文字母被编码成1个字节，汉字通常是3个字节，
# 只有很生僻的字符才会被编码成4-6个字节。
# 如果你要传输的文本包含大量英文字符，用UTF-8编码就能节省空间

print('编码')

print(ord('A'))   # 65 ord()函数获取字符的整数
print(ord('中'))  # 20013
print(chr(66))   # B  chr()函数把编码转换为对应的字符
print(chr(25991))  # 文

print('\u4e2d\u6587')  # 中文  20013 十进制 <-> 4e2d 十六进制

# encode() 可以编码为指定的bytes
print('AB'.encode('ascii'))     # b'AB'
print('中文'.encode('utf-8'))   # b'\xe4\xb8\xad\xe6\x96\x87'

# decode() 从网络或磁盘上读取了字节流，那么读到的数据就是bytes。要把bytes变为str
print(b'AB'.decode('ascii'))   # AB
print(b'AB'.decode('ASCII'))   # AB
print(b'\xe4\xb8\xad\xe6\x96\x87'.decode('utf-8'))  # 中文

# ********************************************************************************

# ********************************************************************************

# ********************************************************************************

# ********************************************************************************
# ********************************************************************************
# ********************************************************************************
# ********************************************************************************
# ********************************************************************************






